Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
/*
 * Copyright 2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "command_console.h"
#include "cyabs_rtos.h"
#include "command_utility.h"
#include "cyhal_uart.h"
#ifdef CY_POWER_ESTIMATOR_ENABLE
#include "cype_command_console.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************
 *                      Macros
 ******************************************************/

/******************************************************
 *                    Constants
 ******************************************************/

#define MAX_PARAMS                              (250)
#define MIN_PARAMS                              (32)

#define MAX_LOOP_CMDS                           (16)
#define MAX_LOOP_LINE_LENGTH                    (128)
#define MAX_NUM_COMMAND_TABLE                   (8)
#define MIN_NUM_COMMAND_TABLE                   (1)

#define CY_CMD_CONSOLE_THREAD_DELAY_IN_MSEC     (100)

#ifndef CONSOLE_THREAD_STACK_SIZE
#define CONSOLE_THREAD_STACK_SIZE               (6*1024)
#endif


/* Enable result info of command */
#define ENABLE_COMMAND_RESULT_INFO

/* Threads stacks */
__attribute__((aligned(8)))
uint8_t command_console_thread_stack[CONSOLE_THREAD_STACK_SIZE] = {0};

#define FLAGS_MSK_RECV 0x00000001ul
#define FLAGS_MSK_DEINIT 0x00000002ul

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

typedef struct
{
#ifdef ENABLE_UART_POLLING
    bool                quit;
#endif
    void*               uart;
    const cy_command_console_cmd_t*   console_command_table_array[MAX_NUM_COMMAND_TABLE];
    int                 command_table_count;
    uint32_t            console_line_len;
    char*               console_buffer;
    uint32_t            console_cursor_position;
    uint32_t            console_current_line;
    bool                console_in_esc_seq;
    char                console_esc_seq_last_char;
    char*               history_buffer;
    uint32_t            history_length;
    uint32_t            history_num_lines;
    uint32_t            history_newest_line;
#if 0
    wiced_ring_buffer_t console_rx_ring_buffer;
#endif
    cy_thread_t         console_thread;
    bool                console_thread_is_running;
    bool                in_process_char;
    bool                console_in_tab_tab;
    const char*         console_delimit_string;
    const char*         console_prompt_string;
    uint8_t             params_num;
} command_console_t;

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Function Declarations
 ******************************************************/

static void         history_load_line         ( uint32_t line, char* buffer );
static void         history_store_line        ( char* buffer );
static uint32_t     history_get_num_lines     ( void );
static bool         console_process_esc_seq   ( char c );
static void         console_load_line         ( uint32_t new_line );
static void         console_insert_char       ( char c );
static void         console_remove_char       ( void );

/* forward declarations */
static void console_do_home      ( void );
static void console_do_end       ( void );
static void console_do_up        ( void );
static void console_do_down      ( void );
static void console_do_left      ( void );
static void console_do_right     ( void );
static void console_do_delete    ( void );
static void console_do_backspace ( void );
static void console_do_tab       ( void );
static cy_command_console_err_t console_do_enter( void );
static cy_command_console_err_t console_do_newline_without_command_repeat( void );

static void send_char( char c );
static void send_str( const char* s );
static void send_charstr( const char* s );
static cy_command_console_err_t console_process_char(char c);
static int loop_command( const char * line );
static int help_command( int argc, char* argv[], tlv_buffer_t** tlv_buf );
static int retval_command( int argc, char* argv[], tlv_buffer_t** tlv_buf );
static cy_command_console_err_t console_parse_cmd( const char* line );

/******************************************************
 *               Variables Definitions
 ******************************************************/

/* default error strings */
static const char* const console_default_error_strings[] =
{
    (char*) "OK",                      /* ERR_CMD_OK */
    (char*) "Unknown Error",           /* ERR_UNKNOWN */
    (char*) "Unknown Command",         /* ERR_UNKNOWN_CMD */
    (char*) "Insufficient Arguments",  /* ERR_INSUFFICENT_ARGS */
    (char*) "Too Many Arguments",      /* ERR_TOO_MANY_ARGS */
    (char*) "Bad Address Value",       /* ERR_ADDRESS */
    (char*) "No Command Entered",      /* ERR_NO_CMD */
    (char*) "Argument too large",      /* ERR_TOO_LARGE_ARG */
    (char*) "Out of heap space",       /* ERR_OUT_OF_HEAP */
    (char*) "Bad argument provided"    /* ERR_BAD_ARG */
};
