Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
static const cy_command_console_cmd_t commands[] =
{
    { (char*) "?",          help_command,                   0, NULL, NULL, NULL, NULL},
    { (char*) "help",       help_command,                   0, NULL, NULL, (char*) "[<command> [<example_num>]]", "Print help message or command example."},
    { (char*) "loop",       NULL,                           0, NULL, NULL, (char*) "<times> <semicolon_separated_commands_list>", "Loops the specified commands for specified number of times."},
    { (char*) "$?",         retval_command,                 0, NULL, NULL, NULL, "Print return value of last executed command."},
#ifdef CY_POWER_ESTIMATOR_ENABLE
    { (char*) "cype_cmd",    cype_cmd_send,                 1, NULL, NULL, (char *)"", (char *)"Trigger WPL commands"},
    { (char*) "cype_debug",  cype_cmd_debug,                1, NULL, NULL, (char *)"", (char *)"Enable/Disable prints on console"},
#endif
    CMD_TABLE_END
};

static const char* const *console_error_strings = console_default_error_strings;
static const char* console_encapsulate_string[] = { (char*) "\"", (char*) "\'" };
static const char* console_bell_string = (char*) "\a";

static void (*tab_handling_func)( void ) = console_do_tab;
static cy_command_console_err_t (*newline_handling_func)( void ) = console_do_newline_without_command_repeat;
static cy_command_console_err_t last_err = ERR_CMD_OK;

#if 0
DEFINE_RING_BUFFER_DATA( static uint8_t, console_rx_ring_data, 64 )
extern const platform_uart_config_t stdio_config;
#endif

static command_console_t cons;
static cy_event_t        ef_id;
static uint8_t           received_character;

/******************************************************
 *               Function Definitions
 ******************************************************/

static inline char hexchar_to_nibble( char hexchar, uint8_t* nibble )
{
    if ( ( hexchar >= '0' ) && ( hexchar <= '9' ) )
    {
        *nibble = (uint8_t)( hexchar - '0' );
        return 0;
    }
    else if ( ( hexchar >= 'A' ) && ( hexchar <= 'F' ) )
    {
        *nibble = (uint8_t) ( hexchar - 'A' + 10 );
        return 0;
    }
    else if ( ( hexchar >= 'a' ) && ( hexchar <= 'f' ) )
    {
        *nibble = (uint8_t) ( hexchar - 'a' + 10 );
        return 0;
    }
    return -1;
}

static size_t string_to_generic( const char* string, size_t str_length,  uint32_t* value_out, uint8_t is_unsigned, uint8_t is_hex )
{
     uint8_t nibble;
     size_t characters_processed = 0;

     if (( string == NULL ) || (value_out == NULL))
     {
         return 0;
     }

     *value_out = 0;

     while ( ( characters_processed != str_length ) &&
             ( 0 == hexchar_to_nibble( *string, &nibble ) ) &&
             ( ( is_hex != 0 ) || ( nibble < 10 ) )
           )
     {
         if ( is_hex != 0 )
         {
             if ( ( ( *value_out > ( 0x7fffffff >> 4 ) ) && ( is_unsigned == 0 ) ) ||
                  ( *value_out > ( 0xffffffff >> 4 ) )
                )
             {
                 break;
             }
             *value_out = ( *value_out << 4 ) + nibble;
         }
         else
         {
             if ( ( ( *value_out > ( 0x7fffffff / 10 ) ) && ( is_unsigned == 0 ) ) ||
                  ( *value_out > ( 0xffffffff / 10 ) )
                )
             {
                 break;
             }
             *value_out = ( *value_out * 10 ) + nibble;
         }
         string++;
         characters_processed++;
     }

     return characters_processed;
}


static uint32_t generic_string_to_unsigned( const char* str )
{
    uint32_t val = 0;
    uint8_t is_hex = 0;

    if ( strncmp( str, "0x", 2 ) == 0 )
    {
        is_hex = 1;
        str += 2;
    }

    string_to_generic( str, strlen(str),  &val, 1, is_hex );

    return val;
}

cy_rslt_t cy_command_console_add_table(const cy_command_console_cmd_t* commands)
{
    int i;

    if ( cons.command_table_count >= MAX_NUM_COMMAND_TABLE )
    {
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    for ( i = 0; i < cons.command_table_count; i++ )
    {
        if (cons.console_command_table_array[i] == commands )
        {
            /* The command table is ready added */
            return CY_RSLT_COMMAND_CONSOLE_FAILURE;
        }
    }
    cons.console_command_table_array[cons.command_table_count++] = commands;

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_command_console_delete_table(const cy_command_console_cmd_t *commands)
{
    int i;

    /* Only allow command table being changed when console thread is not running */
    if (cons.console_thread_is_running == true)
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;

    if ( cons.command_table_count <= MIN_NUM_COMMAND_TABLE )
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;

    /* Skip the base command table (index 0) */
    for ( i = MIN_NUM_COMMAND_TABLE; i < cons.command_table_count; i++ )
    {
        if ( cons.console_command_table_array[i] == commands )
        {
            int j;

            /* Found the command table to be removed */
            /* Move the rest command table up */
            for ( j = i; j < ( cons.command_table_count - 1 ); j++ )
            {
                cons.console_command_table_array[j] = cons.console_command_table_array[j+1];
            }
            cons.console_command_table_array[cons.command_table_count-1] = NULL;
            cons.command_table_count --;
            return CY_RSLT_SUCCESS;
        }
    }

    return CY_RSLT_COMMAND_CONSOLE_FAILURE;
}



/*!
 ******************************************************************************
 * Load a line of history out of the store into the supplied buffer.
 * To change the way the command history is stored, for example to move it to NVM
 * or flash, patch the 3 History functions.
 *
 * @param[in] line    The number of the line to be loaded.
 * @param[in] buffer  Buffer to load the line into.
 *
 * @return  void
 */

static void history_load_line( uint32_t line, char* buffer )
{
    if ( ( line >= cons.history_num_lines ) )
    {
        buffer[0] = 0;
    }
    else
    {
        uint32_t actual_line = ( cons.history_newest_line + cons.history_length - line ) % cons.history_length;
        strncpy( buffer, (char*)&cons.history_buffer[actual_line * cons.console_line_len], cons.console_line_len );
    }
}

/*!
 ******************************************************************************
 * Store a command line into the history. To change the way the command history is
 * stored, for example to move it to NVM or flash, patch the 3 History functions.
 *
 * @param[in] buffer  The line to be stored.
 *
 * @return  void
 */

static void history_store_line( char* buffer )
{
    if ( cons.history_length > 0 )
    {
        cons.history_newest_line = ( cons.history_newest_line + 1 ) % cons.history_length;
        strncpy( (char*)&cons.history_buffer[cons.history_newest_line * cons.console_line_len], buffer, cons.console_line_len );
        if ( cons.history_num_lines < cons.history_length )
        {
            cons.history_num_lines++;
        }
    }
}

/*!
 ******************************************************************************
 * Ask the history store how many lines of history are currently stored.
 * To change the way the command history is stored, for example to move it to NVM
 * or flash, patch the 3 History functions.
 *
 * @return  The number of currently stored lines.
 */

static uint32_t history_get_num_lines( void )
{
    return cons.history_num_lines;
}

/*!
 ******************************************************************************
 * Print a single character.
 *
 * @param[in] c  The string to be printed.
 *
 * @return  void
 */

static void send_char( char c )
{
    putchar(c);
    fflush(stdout);
}

/*!
 ******************************************************************************
 * Print a string.
 *
 * @param[in] s  The string to be printed.
 *
 * @return  void
 */

static void send_str( const char* s )
{
    uint32_t length = strlen(s);
    if ( length > 0 )
    {
        printf("%s",s);
        fflush(stdout);
    }
}

/*!
 ******************************************************************************
 * Print a string character at a time (gets around eCos not printing strings with non printable characters).
 *
 * @param[in] s  The string to be printed.
 *
 * @return  void
 */

static void send_charstr( const char* s )
{
    while ( *s != 0 )
    {
        putchar(*s);
        s++;
    }
    fflush(stdout);
}

