Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
void console_thread_func( cy_thread_arg_t arg )
{
    cy_rslt_t res;

    /* turn off buffers, so IO occurs immediately */
#ifdef _IONBF
    setvbuf( stdin, NULL, _IONBF, 0 );
    setvbuf( stdout, NULL, _IONBF, 0 );
    setvbuf( stderr, NULL, _IONBF, 0 );
#endif

    /* Wait for a while before polling for UART-Rx */
    res = cy_rtos_delay_milliseconds(CY_CMD_CONSOLE_THREAD_DELAY_IN_MSEC);
    if(res != CY_RSLT_SUCCESS)
    {
        printf(" cy_rtos_delay_milliseconds failed, result =  %lu \n", (unsigned long)res);
        return;
    }

    cons.console_thread_is_running = true;

    while ( 1 )
    {
#ifndef ENABLE_UART_POLLING
        uint32_t wait_bits =  FLAGS_MSK_RECV | FLAGS_MSK_DEINIT;
        cy_rtos_waitbits_event(&ef_id, &wait_bits, 1, false, CY_RTOS_NEVER_TIMEOUT);
        if(wait_bits & FLAGS_MSK_RECV)
        {
            console_process_char( received_character );
        }
        if(wait_bits & FLAGS_MSK_DEINIT)
        {
            cy_rtos_exit_thread();
        }
#else
        if (cy_isreadable(cons.uart) == true)
        {
            received_character = cy_read( cons.uart );

            console_process_char( received_character );
        }
        else
        {
            if(cons.quit == true)
            {
                cons.console_thread_is_running = false;
                cy_rtos_exit_thread();
            }
       }
#endif
    }
}

void uart_callback() {
    // Note: you need to actually read from the serial to clear the RX interrupt
    received_character = cy_read( cons.uart );
    cy_rtos_setbits_event(&ef_id, FLAGS_MSK_RECV, 0);
}

cy_rslt_t cy_command_console_status( void )
{
    return (cons.console_thread_is_running ? CY_RSLT_SUCCESS : CY_RSLT_TYPE_ERROR);
}

/* wrapper for console init with a modified thread priority, used for applications with high priority threads like audio capture */
cy_rslt_t cy_command_console_init( cy_command_console_cfg_t *cfg )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if( NULL==cfg )
    {
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    /* Validate thread priority */
    if ( cfg->thread_priority > CY_RTOS_PRIORITY_MAX )
    {
        printf("Input thread priority [%d] is larger than RTOS max thread priority.\n", (int)cfg->thread_priority);
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    /* sanity check: max/min params num */
    if ( cfg->params_num < MIN_PARAMS )
    {
        cfg->params_num = MIN_PARAMS;
    }
    else if ( cfg->params_num > MAX_PARAMS )
    {
        cfg->params_num = MAX_PARAMS;
    }

    if ( ( cfg->buffer != NULL ) && ( cfg->line_len != 0 ) )
    {
        cfg->buffer[0] = '\0';
    }

    /* config and create the console component */
    cons.uart = cfg->serial;

    cons.command_table_count = 0;
    cons.console_line_len = cfg->line_len;
    cons.console_buffer = cfg->buffer;
    cons.params_num = cfg->params_num;

    cons.console_cursor_position = 0;
    cons.console_current_line = 0;
    cons.console_in_esc_seq = false;
    cons.console_esc_seq_last_char = ' ';

    cons.history_buffer = cfg->history_buffer_ptr;
    cons.history_length = cfg->history_len;
    cons.history_num_lines = 0;
    cons.history_newest_line = 0;
#ifdef ENABLE_UART_POLLING
    cons.quit = false;
#endif
    cons.console_delimit_string = cfg->delimiter_string;
    cons.console_prompt_string = "> ";

    cons.console_thread_is_running = false;

    cy_command_console_add_table( commands );

    send_str( cons.console_prompt_string );

    result = cy_rtos_init_event(&ef_id);
    if( result != CY_RSLT_SUCCESS)
    {
        printf(" Error in initializing event flag \n");
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    result = cy_rtos_create_thread(&cons.console_thread, console_thread_func, "Console Thread", command_console_thread_stack,
                                    CONSOLE_THREAD_STACK_SIZE, cfg->thread_priority, NULL);
    if( result != CY_RSLT_SUCCESS)
    {
        printf(" cy_rtos_create_thread failed %lu \n", (unsigned long)result);
        cy_rtos_deinit_event(&ef_id);
        result = CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    return result;
}

cy_rslt_t cy_command_console_deinit(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
#ifdef ENABLE_UART_POLLING
    cons.quit = true;
#else
    result = cy_rtos_setbits_event(&ef_id, FLAGS_MSK_DEINIT, 0);
    if ( result != CY_RSLT_SUCCESS )
    {
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }
#endif
    result = cy_rtos_join_thread(&cons.console_thread);
    if ( result != CY_RSLT_SUCCESS )
    {
        return CY_RSLT_COMMAND_CONSOLE_FAILURE;
    }

    return result;
}

/*!
 ******************************************************************************
 * Load a line from the history into the current line and update the screen.
 * This calls HistoryLoadLine to interface with the history store.
 *
 * @param[in] new_line The index of the line to load from the history.
 *
 * @return    void
 */

static void console_load_line( uint32_t new_line )
{
    uint32_t i;
    uint32_t old_len;
    uint32_t new_len;

    old_len = strlen( cons.console_buffer );

    if ( new_line > 0 )
    {
        history_load_line( new_line - 1, cons.console_buffer );
    }
    else
    {
        cons.console_buffer[0] = 0;
    }
    new_len = strlen( cons.console_buffer );

    /* seek to the start of the line */
    send_char('\r');

    /* print out the prompt and new line */
    send_str( cons.console_prompt_string );
    send_str( cons.console_buffer );

    /* write spaces over the rest of the old line */
    for ( i = new_len; i < old_len; i++ )
    {
        send_char( ' ' );
    }

    /* then move back the same amount */
    for ( i = new_len; i < old_len; i++ )
    {
        send_char( '\b' );
    }

    cons.console_current_line = new_line;

    /* position the cursor at the end of the line */
    cons.console_cursor_position = new_len;
}

/*!
 ******************************************************************************
 * Insert a character into the current line at the cursor position and update the screen.
 *
 * @param[in] c  The character to be inserted.
 *
 * @return    void
 */

