Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
static void console_insert_char( char c )
{
    uint32_t i;
    uint32_t len = strlen( cons.console_buffer );

    /* move the end of the line out to make space */
    for ( i = len + 1; i > cons.console_cursor_position; i-- )
    {
        cons.console_buffer[i] = cons.console_buffer[i - 1];
    }

    /* insert the character */
    len++;
    cons.console_buffer[cons.console_cursor_position] = c;

    /* print out the modified part of the ConsoleBuffer */
    send_str( &cons.console_buffer[cons.console_cursor_position] );

    /* move the cursor back to where it's supposed to be */
    cons.console_cursor_position++;
    for ( i = len; i > cons.console_cursor_position; i-- )
    {
        send_char( '\b' );
    }
}

/*!
 ******************************************************************************
 * Remove a character from the current line at the cursor position and update the screen.
 *
 * @return    void
 */

static void console_remove_char( void )
{
    uint32_t i;
    uint32_t len = strlen( cons.console_buffer );

    /* back the rest of the line up a character */
    for ( i = cons.console_cursor_position; i < len; i++ )
    {
        cons.console_buffer[i] = cons.console_buffer[i + 1];
    }
    len--;

    /* print out the modified part of the ConsoleBuffer */
    send_str( &cons.console_buffer[cons.console_cursor_position] );

    /* overwrite the extra character at the end */
    send_charstr( (char*) " \b" );

    /* move the cursor back to where it's supposed to be */
    for ( i = len; i > cons.console_cursor_position; i-- )
    {
        send_char( '\b' );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a goto home operation.
 *
 * @return  void
 */

static void console_do_home( void )
{
    cons.console_cursor_position = 0;
    send_char('\r');
    send_str(cons.console_prompt_string);
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing an goto end operation.
 *
 * @return  void
 */

static void console_do_end( void )
{
    send_str( &cons.console_buffer[cons.console_cursor_position] );
    cons.console_cursor_position = strlen( cons.console_buffer );
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing an up cursor operation.
 *
 * @return  void
 */

static void console_do_up( void )
{
    if ( cons.console_current_line < history_get_num_lines( ) )
    {
        console_load_line( cons.console_current_line + 1 );
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a down cursor operation.
 *
 * @return  void
 */

static void console_do_down( void )
{
    if ( cons.console_current_line > 0 )
    {
        console_load_line( cons.console_current_line - 1 );
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a left cursor operation.
 *
 * @return  void
 */

void console_do_left( void )
{
    if ( cons.console_cursor_position > 0 )
    {
        send_char( '\b' );
        cons.console_cursor_position--;
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a right cursor operation.
 *
 * @return  void
 */

void console_do_right( void )
{
    if ( cons.console_cursor_position < strlen( cons.console_buffer ) )
    {
        send_char( cons.console_buffer[cons.console_cursor_position] );
        cons.console_cursor_position++;
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a delete operation.
 *
 * @return  void
 */

void console_do_delete( void )
{
    if ( cons.console_cursor_position < strlen( cons.console_buffer ) )
    {
        cons.console_current_line = 0;
        console_remove_char( );
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a backspace operation.
 *
 * @return  void
 */

void console_do_backspace( void )
{
    if ( cons.console_cursor_position > 0 )
    {
        cons.console_current_line = 0;
        cons.console_cursor_position--;
        send_char( '\b' );
        console_remove_char( );
    }
    else
    {
        send_charstr( console_bell_string );
    }
}

/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a new line operation.
 *
 * If the current line is not empty then it's contents will be parsed and invoked.
 * If the current line is empty then the last command will be reinvoked.
 *
 * @return    Console error code indicating if the command was parsed and run correctly.
 */

cy_command_console_err_t console_do_enter( void )
{
    cy_command_console_err_t err = ERR_CMD_OK;

    cons.console_current_line = 0;
    send_str( (char*) "\r\n" );

    if ( strlen( cons.console_buffer ) ) /* if theres something in the buffer */
    {
        if ( strlen( cons.console_buffer ) > strspn( cons.console_buffer, cons.console_delimit_string ) ) /* and it's not just delimit characters */
        {
            /* store it and invoke the command parser */
            history_store_line( cons.console_buffer );
            err = console_parse_cmd( cons.console_buffer );
        }
    }
    else
    {
        if ( history_get_num_lines( ) ) /* if theres a previous history line */
        {
            /* load it and invoke the command parser */
            history_load_line( 0, cons.console_buffer );
            err = console_parse_cmd( cons.console_buffer );
        }
    }

