Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
    /* Update the last return value */
    last_err = err;

    /* prepare for a new line of entry */
    cons.console_buffer[0] = 0;
    cons.console_cursor_position = 0;
    send_str( cons.console_prompt_string );

    return err;
}

/*!
 ******************************************************************************
 * Process escape sequences.
 *
 * This function doesn't process the sequences properly, but does handle all the common
 * ones. The ConsoleEscSeqLastChar variable is used to parse vt320 like sequences
 * without implementing sequence paramater parsing. In general the function doesn't
 * distinguish between the esc-[ and esc-O codes. Despite this the console functions are
 * setup to make sure that any failure doesn't produce non printable characters, so failures
 * should be soft.
 *
 * If you want to handle additional escape sequences then create a wraper patch that has
 * essentially the same code structure as this function and calls this one in its default case(s).
 *
 * @param[in] c  The incomming character.
 *
 * @return    Boolean indicating if more characters are needed to complete the sequence.
 */

bool console_process_esc_seq( char c )
{
    bool still_in_esc_seq = false;

    switch ( c )
    {
        case ';':
        case '[':
        case 'O':
        case '0':
        case '1':
        case '2':
        case '3':
        case '4':
        case '5':
        case '6':
        case '7':
        case '8':
        case '9':
            still_in_esc_seq = true;
            break;
        case 'A': /* up arrow */
            console_do_up( );
            break;
        case 'B': /* down arrow */
            console_do_down( );
            break;
        case 'C': /* right arrow */
            console_do_right( );
            break;
        case 'D': /* left arrow */
            console_do_left( );
            break;
        case 'F': /* end */
            console_do_end( );
            break;
        case 'H': /* home */
            console_do_home( );
            break;
        case '~': /* vt320 style control codes */
            switch ( cons.console_esc_seq_last_char )
            {
                case '1': /* home */
                    console_do_home( );
                    break;
                case '3': /* delete */
                    console_do_delete( );
                    break;
                case '4': /* end */
                    console_do_end( );
                    break;
                default:
                    send_charstr( console_bell_string ); /* unknown escape sequence we are probably in trouble, beep and pretend it's going to be ok */
                    break;
            }
            break;
        default:
            send_charstr( console_bell_string ); /* unknown escape sequence we are probably in trouble, beep and pretend it's going to be ok */
            break;
    }

    cons.console_esc_seq_last_char = c;

    return still_in_esc_seq;
}


const cy_command_console_cmd_t* console_lookup_command( const char *command_name )
{
    int i;
    const cy_command_console_cmd_t* cmd_ptr;

    for ( i = 0; i < cons.command_table_count ; i++ )
    {
        for ( cmd_ptr = cons.console_command_table_array[i]; cmd_ptr->name != NULL; cmd_ptr++ )
        {
            if ( strcmp( command_name, cmd_ptr->name ) == 0 )
            {
                return cmd_ptr;
            }
        }
    }

    return NULL;
}


/*!
 ******************************************************************************
 * Break an input line into command and arguments and invoke it.
 *
 * @param[in] line  The line of input.
 *
 * @return    Console error code indicating if the command was parsed correctly.
 */

cy_command_console_err_t console_parse_cmd( const char* line )
{
    const cy_command_console_cmd_t* cmd_ptr = NULL;
    char** params;
    uint32_t param_cnt = 0;
    char* saveptr = NULL;
    char *copy = malloc (strlen(line) + 1);

    if ( copy == NULL )
    {
        return ERR_OUT_OF_HEAP;
    }
    memset(copy, 0, (strlen(line)+ 1));

    tlv_buffer_t* tlv_data = NULL;

    /* params buffer */
    params = (char**) calloc(cons.params_num, sizeof(char*));
    if ( NULL == params )
    {
        free(copy);
        copy = NULL;
        return ERR_OUT_OF_HEAP;
    }

    /* Copy original buffer into local buffer, as tokenize will change the original string */
    strcpy( copy, line );

    cy_command_console_err_t err = ERR_CMD_OK;

    /* First call to strtok. */
    params[param_cnt++] = strtok_r( copy, cons.console_delimit_string, &saveptr );

    if ( params[0] == NULL ) /* no command entered */
    {
        err = ERR_NO_CMD;
    }
    else
    {
        /* find the command */
        if ( (cmd_ptr = console_lookup_command(params[0])) == NULL )
        {
            err = ERR_UNKNOWN_CMD;
        }
        else if ( strcmp(cmd_ptr->name, "loop") == 0 )
        {
            loop_command( line );
        }
        else
        {
            uint32_t i = 0;
            /* determine argument delimit string */
            const char* delimit;
            if ( cmd_ptr->delimit != NULL )
            {
                delimit = cmd_ptr->delimit;
            }
            else
            {
                delimit = cons.console_delimit_string;
            }

            /* parse arguments */
            while ( saveptr != NULL && saveptr[ 0 ] != '\0' )
            {
                bool encap_flag = false;

                /* Check for delimiters first */
                while ( saveptr[ 0 ] != '\0' )
                {
                    bool delimiter_flag = false;

                    for ( i = 0; i < strlen( delimit ); i++ )
                    {
                        if ( saveptr[ 0 ] == delimit[ i ] )
                        {
                            saveptr++;
                            delimiter_flag = true;
                            break;
                        }
                    }
                    if ( delimiter_flag == false )
                    {
                        break;
                    }
                }
                /* Then check for encapsulation */
                for ( i = 0; i < ( sizeof( console_encapsulate_string ) / sizeof( console_encapsulate_string[ 0 ] ) ); i++ )
                {
                    /* If encapsulated, get encapsulated token */
                    if ( saveptr[ 0 ] == console_encapsulate_string[ i ][ 0 ] )
                    {
                        encap_flag = true;
                        params[ param_cnt ] = strtok_r( NULL, (char *) console_encapsulate_string[ i ], &saveptr );
                        break;
                    }
                }
                /* Else not encapsulated, check for token */
                if ( encap_flag == false )
                {
                    params[ param_cnt ] = strtok_r( NULL, (char *) delimit, &saveptr );
                }

                if ( params[ param_cnt ] != NULL )
                {
                    param_cnt++;
                    if ( param_cnt > (uint8_t)( cons.params_num - 1 ) )
                    {
                        err = ERR_TOO_MANY_ARGS;
                        break;
                    }
                }
            }
            if ( err == ERR_CMD_OK )
            {
                params[ param_cnt ] = NULL;
            }

