Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
            /* check arguments */
            if ( ( param_cnt - 1 ) < (uint32_t)cmd_ptr->arg_count )
            {
                err = ERR_INSUFFICENT_ARGS;
            }

            /* run command */
            if ( ( err == ERR_CMD_OK ) && ( cmd_ptr->command != NULL ) )
            {
                int i = 0;
                //wiced_log_msg(WLF_TEST, WICED_LOG_DEBUG4, "%s:start\n", params[0]);
                err = (cy_command_console_err_t) cmd_ptr->command( param_cnt, params, &tlv_data );

                if( err == 0 && tlv_data != NULL )
                {
                    if( tlv_data->type == 0)
                    {
                        printf("%d%d%.*s",tlv_data->type, tlv_data->length, tlv_data->length, tlv_data->value);
                        printf("\r\n");
                    }
                    else
                    {
                        printf("%d%d",tlv_data->type, tlv_data->length);
                        for (i=0; (i < (tlv_data->length)); i++)
                        {
                            printf ("%d", tlv_data->value[i]);
                        }

                        printf("\r\n");
                    }

#ifdef ENABLE_COMMAND_RESULT_INFO
                    printf("Type ( ascii(0) / binary (1) : %d \r\n", tlv_data->type);
                    printf("Length                       : %d \r\n", tlv_data->length);
                    if ( tlv_data->type == 0)
                    {
                        printf("Value                        : %.*s \r\n",tlv_data->length, tlv_data->value);
                    }
                    else
                    {
                        printf("Value                        : ");
                        for (i=0; (i < (tlv_data->length)); i++)
                        {
                            printf ("%d", tlv_data->value[i]);
                        }
                        printf("\r\n");
                    }
#endif

                free(tlv_data);

                }

                //wiced_log_msg(WLF_TEST, WICED_LOG_DEBUG4, "%s:end\n", params[0]);
            }
        }

        /* process errors */
        if ( err != ERR_CMD_OK )
        {

#ifdef WICED
            /* ensure all strings are present to avoid buffer overrun */
            wiced_static_assert( console_default_error_strings_incomplete, -ERR_LAST_ERROR <= sizeof(console_default_error_strings)/sizeof(const char*) );
#endif

            if ((err <= 0) && (err > ERR_LAST_ERROR))
            {
                printf( "ERROR: %s\r\n", console_error_strings[-err] );
            }
            if ( err != ERR_UNKNOWN_CMD )
            {
                printf("Usage: %s %s\r\n",cmd_ptr->name, cmd_ptr->format);
            }
        }
    }

    free(copy);
    free(params);

    return err;
}



/* help function */
static int help_command( int argc, char* argv[], tlv_buffer_t** tlv_buf )
{
    const cy_command_console_cmd_t* cmd_ptr;
    cy_command_console_err_t err = ERR_CMD_OK;
    uint32_t eg_sel = 0;
    int table_index;

    switch ( argc )
    {
        case 0:
        case 1:
            for ( table_index = 0; table_index < cons.command_table_count; table_index ++ )
            {
                for ( cmd_ptr = cons.console_command_table_array[table_index]; cmd_ptr->name != NULL; cmd_ptr++ )
                {
                    if ( cmd_ptr->format != NULL )
                    {
                        printf( "    %s%c%s\n", cmd_ptr->name, cons.console_delimit_string[0], cmd_ptr->format );
                    }
                    else
                    {
                        printf( "    %s\n", cmd_ptr->name );
                    }

                    if ( cmd_ptr->brief != NULL )
                    {
                        printf( "        - %s\n", cmd_ptr->brief );
                    }
                }
            }
            break;
        default: /* greater than 2 */
#ifdef WICED
            eg_sel = generic_string_to_unsigned( argv[2] );
#endif
            /* Disables Eclipse static analysis warning */
            /* Intentional drop through */
            /* no break */
        case 2:
            err = ERR_UNKNOWN_CMD;
            if ( (cmd_ptr = console_lookup_command(argv[1])) != NULL)
            {
                if ( cmd_ptr->help_example != NULL )
                {
                    err = cmd_ptr->help_example( argv[1], eg_sel );
                }
                else if ( cmd_ptr->brief != NULL )
                {
                    err = ERR_CMD_OK;
                    printf("%s\n", cmd_ptr->brief);
                }
                else
                {
                    err = ERR_CMD_OK;
                    printf( "No example available for %s\n\n", argv[1] );
                }
            }
            break;
    }

    return err;
}

static int retval_command( int argc, char* argv[], tlv_buffer_t** tlv_buf )
{
    if ( last_err == ERR_CMD_OK )
    {
        printf( "0 (OK)\n" );
    }
    else
    {
        printf( "%d (ERROR: %s)\n", last_err,
                (( last_err <= 0 ) && ( last_err > ERR_LAST_ERROR )) ?
                console_error_strings[-last_err] : "Undefined Error" );
    }

    return ERR_CMD_OK;
}

/*!
 ******************************************************************************
 * Loop function : Loops a command or series of commands specified for the no. of times specified
 *
 * @param[in] argc  The number of arguments.
 * @param[in] argv  The arguments.
 *
 * @return    Console error code indicating if the command ran correctly.
 */
int loop_command( const char * line )
{
    int         i, j, times = 0, numcmds = 0;
    cy_command_console_err_t   err = ERR_CMD_OK;
    char        *token;
    char        cmdline[MAX_LOOP_CMDS][MAX_LOOP_LINE_LENGTH];
    char *copy = malloc (strlen(line) + 1);

    if ( copy == NULL )
    {
        return ERR_OUT_OF_HEAP;
    }
    memset(copy, 0, (strlen(line)+ 1));
    strcpy( copy, line );

    /* Parse copy of line to extract repeat count */
    strtok( copy, cons.console_delimit_string );
    token = strtok( NULL, cons.console_delimit_string );

    times = generic_string_to_unsigned( token );

