Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/command_console/command_console.c
    /* Tokenize next by ';' to extract individual cmds to repeat */
    while ( (token = strtok( NULL, ";" )) )
    {
        strncpy( cmdline[numcmds], token, MAX_LOOP_LINE_LENGTH );
        cmdline[numcmds][MAX_LOOP_LINE_LENGTH-1] = 0;
        numcmds++;
    }

    /* free the copy buffer */
    free(copy);
    copy = NULL;

    for ( i = 0; i < times; i++)
    {
        for ( j = 0; j < numcmds; j++)
        {
            err = console_parse_cmd( cmdline[j] );

            if ( err != ERR_CMD_OK )
                return err;
        }
    }

    return err;
}
/*!
 ******************************************************************************
 * Handle a character or escape sequence representing a tab completion operation.
 *
 * @return  void
 */

void console_do_tab( void )
{
    uint32_t buf_len = strlen( cons.console_buffer );
    const cy_command_console_cmd_t* cmd_ptr = NULL;
    int table_index;

    console_do_end( );

    if ( cons.console_in_tab_tab == false )
    {
        const char *src = NULL;
        bool single_match = false;
        uint32_t len = 0;

        /* for each where the buffer matches it's start */
        for ( table_index = 0; table_index < cons.command_table_count ; table_index++ )
        {
            for ( cmd_ptr = cons.console_command_table_array[table_index]; cmd_ptr->name != NULL; cmd_ptr++ )
            {
                if ( strncmp( cmd_ptr->name, cons.console_buffer, buf_len ) == 0 )
                {
                    /* if we already have one or more matches then the completion is the longest common prefix */
                    if ( src )
                    {
                        single_match = false;
                        uint32_t i = buf_len;
                        while ( ( i < len ) && ( src[i] == cmd_ptr->name[i] ) )
                        {
                            i++;
                        }
                        len = i;
                    }
                    /* for the first match the completion is the whole command */
                    else
                    {
                        single_match = true;
                        src = cmd_ptr->name;
                        len = strlen( cmd_ptr->name );
                    }
                }
            }
        }

        /* if there is a valid completion then add it to the buffer */
        if ( src && ( ( len > strlen( cons.console_buffer ) ) || single_match ) )
        {
            uint32_t i;
            for ( i = buf_len; i < len; i++ )
            {
                console_insert_char( src[i] );
            }
            if ( single_match )
            {
                console_insert_char( ' ' );
            }
        }
        else
        {
            cons.console_in_tab_tab = true;
        }
    }
    else
    {
        uint32_t cnt = 0;

        for ( table_index = 0; table_index < cons.command_table_count ; table_index++ )
        {
            for ( cmd_ptr = cons.console_command_table_array[table_index]; cmd_ptr->name != NULL; cmd_ptr++ )
             {
                if ( ( strncmp( cmd_ptr->name, cons.console_buffer, buf_len ) == 0 ) && ( strcmp( cmd_ptr->name, "" ) != 0 ) )
                {
                    if ( ( cnt % 4 ) == 0 )
                    {
                        send_str( (char*) "\r\n" );
                    }
                    else
                    {
                        send_char( ' ' );
                    }
                    printf( "%-19.19s", cmd_ptr->name );
                    cnt++;
                }
            }
        }
        if ( cnt )
        {
            send_str( (char*) "\r\n" );
            send_str( cons.console_prompt_string );
            send_str( cons.console_buffer );
        }
        cons.console_in_tab_tab = false;
    }
}

/*!
 ******************************************************************************
 * Version of the console newline handler that does not repeat previous command
 * when newline pressed on empty line.
 */

cy_command_console_err_t console_do_newline_without_command_repeat( void )
{
    cy_command_console_err_t err = ERR_CMD_OK;

    if ( strlen( cons.console_buffer ) ) /* if theres something in the buffer */
    {
        err = console_do_enter( );
    }
    else
    {
        /* prepare for a new line of entry */
        cons.console_buffer[0] = 0;
        cons.console_cursor_position = 0;
        send_str( (char*) "\r\n" );
        send_str( cons.console_prompt_string );
    }
    return err;
}

/*!
 ******************************************************************************
 * Process regular characters.
 *
 * If you want to handle additional characters then create a wraper patch that has essentially
 * the same code structure as this function and calls this one in its default case(s).
 *
 * @param[in] c  The incoming character.
 *
 * @return    Console error code indicating if the character and any resulting command were processed correctly.
 */

cy_command_console_err_t console_process_char( char c )
{
    cy_command_console_err_t err = ERR_CMD_OK;
    cons.in_process_char = true;

    if ( cons.console_in_esc_seq )
    {
        cons.console_in_esc_seq = console_process_esc_seq( c );
    }
    else
    {
        switch ( c )
        {
            case 9: /* tab char */
                if ( tab_handling_func )
                {
                    tab_handling_func( );
                }
                break;
            case 10: /* line feed */
                /* ignore it */
                break;
            case '\r': /* newline */
                if ( newline_handling_func )
                {
                    err = newline_handling_func( );
                }
                break;
            case 27: /* escape char */
                cons.console_in_esc_seq = true;
                break;
            case '\b': /* backspace */
            case '\x7F': /* backspace */
                console_do_backspace( );
                break;
            case 16: /* ctrl-p */
                console_do_up( );
                break;
            case 14: /* ctrl-n */
                console_do_down( );
                break;
            case 2: /* ctrl-b */
                console_do_left( );
                break;
            case 6: /* ctrl-f */
                console_do_right( );
                break;
            case 1: /* ctrl-a */
                console_do_home( );
                break;
            case 5: /* ctrl-e */
                console_do_end( );
                break;
            case 4: /* ctrl-d */
                console_do_delete( );
                break;
            default:
                if ( ( c > 31 ) && ( c < 127 ) )
                {
                    /* limit to printables */
                    if ( (strlen( cons.console_buffer ) + 1) < cons.console_line_len )
                    {
                        cons.console_current_line = 0;
                        console_insert_char( c );
                    }
                    else
                    {
                        send_charstr( console_bell_string );
                    }
                }
                else
                {
                    send_charstr( console_bell_string );
                }
                break;
        }
    }

